""" 卡尔曼滤波器

系统模型
    状态更新方程:   x(t) = F⋅x(t-1) + B⋅u(t) + w(t)
    观测方程:       z(t) = H⋅x(t) + v(t)
    x为状态变量, z为观测变量, u为控制量, 如果没有则为0; 
    F为状态转移矩阵, H为观测矩阵, w为过程噪声, v为观测噪声
    w ~ N(0, Q), v ~ N(0, R), Q为过程噪声协方差矩阵, R为观测噪声协方差矩阵
    
系统计算
    卡尔曼滤波器的操作包括两个阶段：预测与更新
    
    预测：滤波器使用上一状态的估计，做出对当前状态的估计
        状态先验估计:    x_(t) = F⋅x(t-1) + B⋅u(t)
        状态协方差预估:  P_(t) = F⋅P(t-1)⋅F^T + Q(t)
        x_为状态先验估计, P为状态协方差矩阵, P_为状态协方差先验估计
        
    更新: 利用当前时刻的观测修正先验估计得到后验估计
        观测余量:        y(t) = z(t) - H⋅x_(t)
        观测的协方差:    S(t) = H⋅P_(t)⋅H^T + R(t)
        卡尔曼增益:      K(t) = P_(t) ⋅ H^T ⋅ S(t)^-1
        状态后验估计:    x(t) = x_(t) + K(t)⋅y(t) = (I - K(t)⋅H)⋅x_(t) + K(t)⋅z(t)
        状态协方差更新:  P(t) = (I - K(t)⋅H) ⋅ P_(t)
"""
